-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               10.1.18-MariaDB - mariadb.org binary distribution
-- Операционная система:         Win64
-- HeidiSQL Версия:              9.3.0.5123
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Дамп структуры базы данных prozorro
CREATE DATABASE IF NOT EXISTS `prozorro` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `prozorro`;

-- Дамп структуры для таблица prozorro.actions
CREATE TABLE IF NOT EXISTS `actions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `action_type` varchar(50) NOT NULL,
  `user_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `item_name` text NOT NULL,
  `item_type` varchar(50) NOT NULL,
  `new_item_name` text,
  `new_item_description` longtext,
  `new_parent_id` int(11) DEFAULT NULL,
  `state` int(11) NOT NULL DEFAULT '0',
  `creation_date` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.actions: ~0 rows (приблизительно)
DELETE FROM `actions`;
/*!40000 ALTER TABLE `actions` DISABLE KEYS */;
/*!40000 ALTER TABLE `actions` ENABLE KEYS */;

-- Дамп структуры для таблица prozorro.indicators
CREATE TABLE IF NOT EXISTS `indicators` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `object_id` int(11) NOT NULL,
  `name` text NOT NULL,
  `description` longtext,
  `user_id` int(11) NOT NULL,
  `creation_date` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.indicators: ~4 rows (приблизительно)
DELETE FROM `indicators`;
/*!40000 ALTER TABLE `indicators` DISABLE KEYS */;
INSERT INTO `indicators` (`id`, `object_id`, `name`, `description`, `user_id`, `creation_date`) VALUES
	(1, 440, 'на 1 жовтня 2017  року', 'Кількість населення: 42434767', 1, '09.12.17 19:04'),
	(2, 440, 'середня чисельність у січні-вересні 2017 року', 'Кількість населення: 42509655', 1, '09.12.17 19:04'),
	(3, 441, 'на 1 жовтня 2017  року', 'Кількість населення: 1579471', 1, '09.12.17 19:07'),
	(4, 441, 'середня чисельність у січні-вересні 2017 року', 'Кількість населення: 1584914', 1, '09.12.17 19:07');
/*!40000 ALTER TABLE `indicators` ENABLE KEYS */;

-- Дамп структуры для таблица prozorro.object_tree
CREATE TABLE IF NOT EXISTS `object_tree` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `node_type` int(11) NOT NULL,
  `name` text NOT NULL,
  `description` longtext,
  `user_id` int(11) NOT NULL DEFAULT '0',
  `node_level` int(11) NOT NULL,
  `left_key` int(11) NOT NULL,
  `right_key` int(11) NOT NULL,
  `creation_date` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=467 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.object_tree: ~68 rows (приблизительно)
DELETE FROM `object_tree`;
/*!40000 ALTER TABLE `object_tree` DISABLE KEYS */;
INSERT INTO `object_tree` (`id`, `node_type`, `name`, `description`, `user_id`, `node_level`, `left_key`, `right_key`, `creation_date`) VALUES
	(399, 0, 'Бібліотека ієрархічних даних', NULL, 0, 1, 1, 136, NULL),
	(400, 0, 'Демографічна та соціальна статистика', '', 1, 3, 3, 86, '09.12.17 18:40'),
	(401, 0, 'Економічна статистика', '', 1, 3, 87, 128, '09.12.17 18:40'),
	(402, 0, 'Багатогалузева статистична інформація', '', 1, 3, 129, 134, '09.12.17 18:40'),
	(403, 0, 'Економічна діяльність', '', 1, 4, 88, 113, '09.12.17 18:40'),
	(404, 0, 'Населення та міграція', '', 1, 4, 4, 69, '09.12.17 18:41'),
	(405, 0, 'Ринок праці', '', 1, 4, 70, 71, '09.12.17 18:41'),
	(406, 0, 'Освіта', '', 1, 4, 72, 73, '09.12.17 18:41'),
	(407, 0, 'Охорона здоров\'я', NULL, 1, 4, 74, 75, NULL),
	(408, 0, 'Доходи та умови життя', '', 1, 4, 76, 77, '09.12.17 18:43'),
	(409, 0, 'Соціальний захист', '', 1, 4, 78, 79, '09.12.17 18:44'),
	(410, 0, 'Населені пункти та житло', '', 1, 4, 80, 81, '09.12.17 18:44'),
	(411, 0, 'Правосуддя та злочинність', '', 1, 4, 82, 83, '09.12.17 18:44'),
	(412, 0, 'Культура', '', 1, 4, 84, 85, '09.12.17 18:44'),
	(413, 0, 'Макроекономічна статистика', '', 1, 4, 114, 115, '09.12.17 18:47'),
	(414, 0, 'Національні рахунки', '', 1, 4, 116, 117, '09.12.17 18:47'),
	(415, 0, 'Державні фінанси, податки та публічний сектор', '', 1, 4, 118, 119, '09.12.17 18:47'),
	(416, 0, 'Зовнішньоекономічна діяльність', '', 1, 4, 120, 121, '09.12.17 18:49'),
	(417, 0, 'Ціни', '', 1, 4, 122, 123, '09.12.17 18:49'),
	(418, 0, 'Наука, технології та інновації', '', 1, 4, 124, 125, '09.12.17 18:49'),
	(419, 0, 'Інформаційне суспільство', '', 1, 4, 126, 127, '09.12.17 18:49'),
	(420, 0, 'Діяльність підприємств', '', 1, 5, 89, 90, '09.12.17 18:50'),
	(421, 0, 'Внутрішня торгівля', '', 1, 5, 91, 92, '09.12.17 18:50'),
	(422, 0, 'Капітальні інвестиції', '', 1, 5, 93, 94, '09.12.17 18:50'),
	(423, 0, 'Основні засоби', '', 1, 5, 95, 96, '09.12.17 18:50'),
	(424, 0, 'Сільське, лісове та рибне господарство', '', 1, 5, 97, 98, '09.12.17 18:50'),
	(425, 0, 'Енергетика', '', 1, 5, 99, 100, '09.12.17 18:50'),
	(426, 0, 'Промисловість', '', 1, 5, 101, 102, '09.12.17 18:52'),
	(427, 0, 'Будівництво', '', 1, 5, 103, 104, '09.12.17 18:52'),
	(428, 0, 'Транспорт', '', 1, 5, 105, 106, '09.12.17 18:52'),
	(429, 0, 'Туризм', '', 1, 5, 107, 108, '09.12.17 18:52'),
	(430, 0, 'Реєстр статистичних одиниць', '', 1, 5, 109, 110, '09.12.17 18:52'),
	(431, 0, 'Навколишнє середовище', '', 1, 5, 111, 112, '09.12.17 18:52'),
	(432, 0, 'Комплексна статистика', '', 1, 4, 130, 131, '09.12.17 18:52'),
	(433, 0, 'Регіональна статистика', '', 1, 4, 132, 133, '09.12.17 18:53'),
	(434, 0, 'Чисельність населення', '', 1, 5, 5, 58, '09.12.17 18:57'),
	(435, 0, 'Природний рух населення', '', 1, 5, 59, 60, '09.12.17 18:57'),
	(436, 0, 'Міграційний рух населення', '', 1, 5, 61, 62, '09.12.17 18:57'),
	(437, 0, 'Кількість адміністративно-територіальних одиниць', '', 1, 5, 63, 64, '09.12.17 18:57'),
	(438, 0, 'Населення (1990-2017)', '', 1, 5, 65, 66, '09.12.17 18:57'),
	(439, 0, 'Методологічні пояснення', '', 1, 5, 67, 68, '09.12.17 18:57'),
	(440, 1, 'Україна ', '', 1, 6, 6, 7, '09.12.17 18:59'),
	(441, 1, 'Вінницька ', '', 1, 6, 8, 9, '09.12.17 18:59'),
	(442, 1, 'Волинська ', '', 1, 6, 10, 11, '09.12.17 18:59'),
	(443, 1, 'Дніпропетровська ', '', 1, 6, 12, 13, '09.12.17 19:00'),
	(444, 1, 'Донецька ', '', 1, 6, 14, 15, '09.12.17 19:00'),
	(445, 1, 'Житомирська ', '', 1, 6, 16, 17, '09.12.17 19:00'),
	(446, 1, 'Закарпатська ', '', 1, 6, 18, 19, '09.12.17 19:00'),
	(447, 1, 'Запорізька ', '', 1, 6, 20, 21, '09.12.17 19:00'),
	(448, 1, 'Івано-Франківська ', '', 1, 6, 22, 23, '09.12.17 19:00'),
	(449, 1, 'Київська ', '', 1, 6, 24, 25, '09.12.17 19:00'),
	(450, 1, 'Кіровоградська ', '', 1, 6, 26, 27, '09.12.17 19:00'),
	(451, 1, 'Луганська ', '', 1, 6, 28, 29, '09.12.17 19:00'),
	(452, 1, 'Львівська ', '', 1, 6, 30, 31, '09.12.17 19:01'),
	(453, 1, 'Миколаївська ', '', 1, 6, 32, 33, '09.12.17 19:01'),
	(454, 1, 'Одеська ', '', 1, 6, 34, 35, '09.12.17 19:01'),
	(455, 1, 'Полтавська ', '', 1, 6, 36, 37, '09.12.17 19:01'),
	(456, 1, 'Рівненська ', '', 1, 6, 38, 39, '09.12.17 19:01'),
	(457, 1, 'Сумська ', '', 1, 6, 40, 41, '09.12.17 19:01'),
	(458, 1, 'Тернопільська ', '', 1, 6, 42, 43, '09.12.17 19:01'),
	(459, 1, 'Харківська ', '', 1, 6, 44, 45, '09.12.17 19:01'),
	(460, 1, 'Херсонська ', '', 1, 6, 46, 47, '09.12.17 19:01'),
	(461, 1, 'Хмельницька ', '', 1, 6, 48, 49, '09.12.17 19:01'),
	(462, 1, 'Черкаська ', '', 1, 6, 50, 51, '09.12.17 19:01'),
	(463, 1, 'Чернівецька ', '', 1, 6, 52, 53, '09.12.17 19:02'),
	(464, 1, 'Чернігівська ', '', 1, 6, 54, 55, '09.12.17 19:02'),
	(465, 1, 'м.Київ ', '', 1, 6, 56, 57, '09.12.17 19:02'),
	(466, 0, 'Дані Державної служби статистики України', '', 1, 2, 2, 135, '09.12.17 19:11');
/*!40000 ALTER TABLE `object_tree` ENABLE KEYS */;

-- Дамп структуры для таблица prozorro.users
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(50) NOT NULL DEFAULT '0',
  `password` varchar(50) NOT NULL DEFAULT '0',
  `first_name` text NOT NULL,
  `second_name` text NOT NULL,
  `organization` text NOT NULL,
  `first_action_id` int(11) NOT NULL DEFAULT '0',
  `last_action_id` int(11) NOT NULL DEFAULT '0',
  `creation_date` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.users: ~1 rows (приблизительно)
DELETE FROM `users`;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` (`id`, `login`, `password`, `first_name`, `second_name`, `organization`, `first_action_id`, `last_action_id`, `creation_date`) VALUES
	(1, 'admin', '12345678', 'Administrator', '', '', 0, 8, NULL),
	(5, 'andriyluchko@gmail.com', '123456789', 'Андрій', 'Лучко', 'ВНТУ', 0, 0, '09.12.17 20:34');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
