-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               10.1.18-MariaDB - mariadb.org binary distribution
-- Операционная система:         Win64
-- HeidiSQL Версия:              9.3.0.5123
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Дамп структуры базы данных prozorro
CREATE DATABASE IF NOT EXISTS `prozorro` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `prozorro`;

-- Дамп структуры для таблица prozorro.actions
CREATE TABLE IF NOT EXISTS `actions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `action_type` varchar(50) NOT NULL,
  `user_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `item_name` text NOT NULL,
  `item_type` varchar(50) NOT NULL,
  `new_item_name` text,
  `new_item_description` longtext,
  `new_parent_id` int(11) DEFAULT NULL,
  `state` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.actions: ~0 rows (приблизительно)
DELETE FROM `actions`;
/*!40000 ALTER TABLE `actions` DISABLE KEYS */;
/*!40000 ALTER TABLE `actions` ENABLE KEYS */;

-- Дамп структуры для таблица prozorro.indicators
CREATE TABLE IF NOT EXISTS `indicators` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `skill_id` int(11) NOT NULL,
  `name` text NOT NULL,
  `description` longtext,
  `user_id` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.indicators: ~18 rows (приблизительно)
DELETE FROM `indicators`;
/*!40000 ALTER TABLE `indicators` DISABLE KEYS */;
INSERT INTO `indicators` (`id`, `skill_id`, `name`, `description`, `user_id`) VALUES
	(3, 121, 'Вміння бачити велику картинку', 'Здібність працювати із широким спектром питань, ідентифікувати пріоритети та виокремлюватиголовне.', 1),
	(4, 121, 'Планування та узгодження', 'Вміння спланувати та пріоритезувати роботу для виконання цілей, що узгоджуються з організаційними стратегіями.', 1),
	(5, 121, 'Творчість та інноваційність', 'Здатність пропонувати нові та унікальні ідеї в контексті роботи. Заохочувати колег мислити по іншому при вирішенні проблем. Вміння втілити творчу ідею в роботу, та постійне бажання шукати новішляхи впогляді наситуацію.', 1),
	(6, 122, 'Ефективне виконання', 'Вміння виконувати завдання із думкою про найвищу якість виконання на усіх етапах, з наявнимиресурсамитавраховуючиризики.', 1),
	(7, 122, 'Орієнтація на досягнення результату', 'Досягає результату, навіть у важких обставинах. Орієнтація доводити справи до кінця. Вміння організувати себе та інших досягати бажаного в роботі. Демонструє ентузіазм та енергію. Вміння вчитися із успіхів та невдач, щоб покращувати власнудіяльність.', 1),
	(8, 122, 'Вміння вирішувати проблеми', 'Вміння аналізувати ситуації, діагностувати проблеми, визначати ключові проблеми та оцінювати альтернативи для вирішення питань. Вирішувати проблеми із думкою win-win (перемога-перемога).', 1),
	(9, 122, 'Управління змінами', 'Вміння бачити, де потрібні зміни та доносити бачення змін у позитивній манері, акцентуючи увагу на нових можливостях. Легко сприймає необхідністьзмінвсвоїйроботі.', 1),
	(10, 123, 'Вміння мотивувати та надихати', 'Вміння налагоджувати емоційний позитивний контакт із підлеглими/колегами, створювати атмосферу в якій люди хочуть проявляти найкращі якості. Знати особливості кожного та адаптувати підходи до комунікацій. Делегувати та заохочувати підлеглих/колег до розвитку та визнавати їх внески вроботііндивідуальнота публічно.', 1),
	(11, 123, 'Розбудова продуктивної команди', 'Вміння створити команду із різних по типу особистості людей, розділяти з ними перемоги та неуспіхи. Сприяти відкритому діалогу між людьми, визначати успіх в розрізі внеску кожного у виконаннязавдання.', 1),
	(12, 123, 'Розвиток підлеглих / колег', 'Ставити цілі, що розвивають підлеглих, та спрямування їх використовувати всі переваги від навчальних подій. Організовувати навчання на робочому місці, даючи змогу приймати участь у завданнях, що є викликом. Створювати середовище для постійного навчання та вдосконалення підлеглих/колег та надання зворотного зв’язку із метоюїх розвитку.', 1),
	(13, 123, 'Вміння делегувати', 'Вміння розділяти завдання та відповідальність за роботу із підлеглими, схильність їм довіряти. Не втручатись в роботу підлеглих поки завдання не закінчене. Довіряти виконувати як прості і рутинні завдання,такіскладнічастинироботи.', 1),
	(14, 124, 'Вміння будувати довірливі стосунки', 'Вміння викликати впевненість тадовіру інших через чесність, порядність та щирість. Завжди виконувати обіцянки, вселяти довіру та дотримуватись послідовності між словами тадіями.', 1),
	(15, 124, 'Управління конфліктами', 'Використання конфлікту як можливість почути точку зору та ідеї інших. Вміти працювати над важкими завданнями та ефективно вирішувати конфліктні ситуації. Сприяти знаходженню проривів в інтегруванні різних точок зору та знаходити спільні територіїдляподальшоївзаємодії.', 1),
	(16, 124, 'Керування двозначністю', 'Вміння діяти безбачення всієї картинки, навітьякщо невсідеталі прояснені докінця або шляхи длявирішення не зрозумілі повністю. Здатність виконувати те, що очікують не зважаючи на зміни та непевність. Ефективно керуватиризиками.', 1),
	(17, 125, 'Демонструвати самоусвідомлення', 'Постійний пошук зворотного зв’язку з метою самовдосконалення. Вміння почути думку інших для визначення та розуміння власних сильних сторін та сторін для розвитку. Бути відкритим до критики та розмов про власні недоліки. Здатність визнавати помилки та бажання їх виправити.', 1),
	(18, 125, 'Саморозвиток', 'Активний пошук нових шляхів для професійного зростання, та створення викликів самому собі. Розвиватись та використовувати для цього як формальні так і неформальні канали. Вміння вчитись від набутого досвіду, від інших, від спланованих навчань. Розширювати свою спроможність.', 1),
	(19, 125, 'Ресурсність', 'Вміння правильно розподілити енергію та власні сили у виконанні роботи. Вміння отримувати максимум із обмежених ресурсів та спрямовувати різноманітні активності одночасно, щоб досягнути мети.', 1),
	(20, 125, 'Терпимість та витриманість', 'Вміння вислуховувати та уточнювати розуміння інших перед тим як діяти. Розуміти інших людей та їхні мотиви. Оцінювати всю ситуацію, не робити поспішних висновків. Не проявляти надмірних негативних емоцій якщо щось іде непоплану,зберігати ресурсний стан.', 1),
	(21, 125, 'Сміливість', 'Не боятись вирішення важких питань. Бажання та вміння давати зворотній зв*язок. Бути першим, щоб випробувати нову ідею або точку зору без огляду на думку оточуючих.', 1);
/*!40000 ALTER TABLE `indicators` ENABLE KEYS */;

-- Дамп структуры для таблица prozorro.skill_tree
CREATE TABLE IF NOT EXISTS `skill_tree` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `node_type` int(11) NOT NULL,
  `name` text NOT NULL,
  `description` longtext,
  `user_id` int(11) NOT NULL,
  `node_level` int(11) NOT NULL,
  `left_key` int(11) NOT NULL,
  `right_key` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=127 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.skill_tree: ~7 rows (приблизительно)
DELETE FROM `skill_tree`;
/*!40000 ALTER TABLE `skill_tree` DISABLE KEYS */;
INSERT INTO `skill_tree` (`id`, `node_type`, `name`, `description`, `user_id`, `node_level`, `left_key`, `right_key`) VALUES
	(119, 0, 'Бібліотека компетенцій', NULL, 0, 1, 1, 14),
	(120, 0, 'ProZorro', '', 1, 2, 2, 13),
	(121, 1, 'Робота з інформацією ', '', 1, 3, 3, 4),
	(122, 1, 'Робота із завданнями та цілями ', '', 1, 3, 5, 6),
	(123, 1, 'Управління людьми ', '', 1, 3, 7, 8),
	(124, 1, 'Розбудова ефективних взаємовідносин ', '', 1, 3, 9, 10),
	(125, 1, 'Особиста ефективність ', '', 1, 3, 11, 12);
/*!40000 ALTER TABLE `skill_tree` ENABLE KEYS */;

-- Дамп структуры для таблица prozorro.users
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(50) NOT NULL DEFAULT '0',
  `password` varchar(50) NOT NULL DEFAULT '0',
  `first_name` text NOT NULL,
  `second_name` text NOT NULL,
  `organization` text NOT NULL,
  `first_action_id` int(11) NOT NULL DEFAULT '0',
  `last_action_id` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы prozorro.users: ~3 rows (приблизительно)
DELETE FROM `users`;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` (`id`, `login`, `password`, `first_name`, `second_name`, `organization`, `first_action_id`, `last_action_id`) VALUES
	(1, 'admin', '12345678', 'Administrator', '', '', 0, 0),
	(2, 'test', '87654321', 'Andy', 'Lucky', '', 0, 0),
	(4, 'vasia@mail.ru', '123123123', 'Василь', 'Pupkin', '', 0, 0);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
